{"Characters/James-the-Monk":{"title":"James the Monk","links":[],"tags":[],"content":"The literal GOAT.\nI hope he does not go to a game in a helicopter, we need more stunning strikes, not air strikes."},"Characters/Kovir":{"title":"Kovir","links":["Characters/Rexton-Redbrand","Cokt","Revolt","Characters/James-the-Monk"],"tags":[],"content":"Kovir was a Giant Artificer, although his creations were a bit unorthodox compared to the other Artificers of the time. He was much more fascinated with the mechanical components than the arcane arts. He was known by some for creating a number of small trinkets that solved mundane tasks, but this all changed when he was approached by the renowned hunter Rexton Redbrand. Rexton needed a powerful weapon for when he went on his hunts for Giants, and who better than a Giant inventor to create a weapon with their explicit weaknesses in mind.\nKovir had very low standing in Giant society, mainly due to his numerous business deals with the Human world. He did not hate all of his own kind, but this type of status jump was too much to pass up on. In exchange for his work, Rexton offered the Artificer his old estate, which had plenty of land to grow crops on. On top of this, Rexton would supply Giants to Kovir to be his slaves. It was on one of these shipments that Cokt was sent to the estate. As time went on and more and more Giants were sent to the Estate, Kovir began to hate his own race.\nIt was through these shipments, all of which were delivered by associates of Rexton, that Kovir got into contact with the Dragon Cult. They were interested in help designing a large energy beam that could be shot into the stratosphere, and Kovir was intrigued by their plan. Though he did not perform any of the physical labor, he completely designed the system and apparatus, and the machine was built by the Cult.\nThe Revolt may have lost Kovir has magnum opus, as well as many slaves, but not his resolve. He still had the plans and a failed prototype that could be improved. He just needed to retrieve some more components before Rexton found out. Kovir set out to meet up with the Clan, who could provide him with the resources he needed, more slaves, and payment for his newly completed designs.\nAfter the events of the Revolt, Kovir would have his fateful reunion with his “Little One”. In a long and arduous battle in a canyon, complete with mystical masks, Giant slaves, deception, and an awesome maneuver by James the Monk, Kovir fell at the hands of Cokt and his party. Cokt confronted Kovir in Giant and made his peace before blasting the Giant with his own creation, taking his life."},"Characters/Krilrym":{"title":"Krilrym","links":[],"tags":[],"content":"Krilrym Quartzheart is a Giant Bard. He grew up with the Dwarves, who raised him and integrated him into their society. He was taken in by a clan of miners, one of which was a Bard himself. Krilrym worked with the miners in the mines, most closely to the Bard, helping inspire them. Though he could not fit into the same spaces, due to his stature, he was eager to help carry their spoils or inspire them through his music. When a new buyer searching for precious gems, Kovir, came to accept a shipment, Krilrym was quickly sold off to the Estate for a small fee. He became yet another inspirer on the Estate, singing his Dwarven tunes to help his brothers get through their days.\nAfter the events of the Revolt, Krilrym has not been seen by anyone. His whereabouts are a complete mystery."},"Characters/Rexton-Redbrand":{"title":"Rexton Redbrand","links":["Characters/Kovir","Firearm"],"tags":[],"content":"Rexton Redbrand is a Human hunter, known far and wide for hunting Giants. He travelled around to exotic locations, tracking down and killing the various types of Giants that lived in the area. Despite his popularity with the Human world, he was not widely discussed among the Giants, as their society is much more removed from the hustle, bustle, and celebrities in puny human society.\nRexton commissioned Kovir the Giant to create the Nine Realm’s first Firearm.\nThe Redbrand family are devout worshippers of Tiamat, though Rexton cares much more about hunting, fame, money, looking cool, and Elven women than “some dragon”. He’s more of a black sheep to them, and not very high or respected in their ranks."},"Early-Life":{"title":"Early Life","links":["Characters/Kovir"],"tags":[],"content":"Cokt’s earliest memory is behind bars, with the sound of horseshoes and thumping in the background. Falling in and out of sleep and feeling very out of his own control, he remembers being held by enormous hands, strange noises being spoken, and being awoken by a soon familiar face. Kovir the Giant, was standing in front of the Goblin, looking perplexed and confused. The first thing that was ever said to Cokt, in his memory, were the words “Time for work, little one.”, spoken in Giant. Kovir immediately put Cokt to work, sending him to get anything the craftsman needed during the day. Kovir was not a cruel master to Cokt, but, other than rage, he did not show any emotion to Cokt. Their relationship was sterile at best.\nCokt was able to find a family in the other slaves. The Giants took him in as one of their own. Cokt stayed in a cot in the mansion, while the others slept in their quarters outside, but Cokt would sneak away any chance he got to see his pseudo-family. They taught him Giant, let him join them in their games and rest, and explained the intricacies of Kovir and his business dealings as best they could. They taught him their songs and how to do the work they were performing. Cokt would steal any bits of food he could from the kitchen and any medical supplies to give to the Giants. After some time, the Giants addressed Cokt as their “brother”, and he thought of them as his."},"Firearm":{"title":"Firearm","links":["Characters/Kovir","Characters/Rexton-Redbrand"],"tags":[],"content":"The Nine Realm’s first firearm was engineered by Kovir the Giant, and commissioned by Rexton Redbrand. It was designed to specifically hunt and destroy Giants, taking advantage of the way they fought and their weaknesses. It was stolen by Cokt on the night of the revolt and imbued"},"Life-on-the-Estate":{"title":"Life on the Estate","links":["Characters/Krilrym","Revolt"],"tags":[],"content":"Cokt’s strongest connection was with the Bard, Krilrym. Krilrym acted as the father that Cokt never had. He was a shoulder to cry on and a much needed confidant for a frightened young goblin. One of Cokt’s favorite things to do with Krilrym was listen to him sing, and the Bard made sure to teach Cokt as much as the goblin could remember. Cokt was often reprimanded by Kovir for humming tunes during long working sessions, but the Giants were fond of Cokt’s accompaniment in their working and party songs.\nCokt hated how Kovir treated his Giants. They were constantly beaten and demeaned. If they underperformed, he would not feed them (though they were not getting enough even when they worked to his standards). Though he always followed orders and was never subject to the same treatment, Cokt could not stand to see his brothers treated like this. He began to develop a deep hatred for Kovir, though he could never let it show, for he had a plan brewing.\nCokt spent much time in Kovir’s workshop, so he was around for much of the creation of the firearm. He did not understand the inner workings or the true purpose of the device, but he understood its significance. Kovir would hyper focus on its conception and Cokt was always busy fetching the next piece of the machine. Cokt hated the loud and destructive testing sessions, especially since he had to clean up and repair any damages. As detailed as he could, he would explain everything he saw to Krilrym. Thanks to the Bard’s knowledge of the arcane, he was able to pick up more of an understanding of the device than Cokt was. Krilrym understood that the weapon was of great importance to the future of his people, so he began to plan a Revolt."},"Locht":{"title":"Locht","links":["Characters/Kovir","Revolt","Firearm"],"tags":[],"content":"Locht was the Giant cook on Kovir’s estate. He stayed with the other Giants and prepared their meals after long days of work. Locht would often send Cokt into the kitchen looking for specific ingredients or recipes to add to his repertoire. He eventually perished on the night of the Revolt at the hands of Kovir while trying to protect Cokt and the Firearm."},"Revolt":{"title":"Revolt","links":["Characters/Krilrym","Characters/Kovir","Firearm","Locht","The-Future"],"tags":[],"content":"Krilrym knew that something must be done about the impending doom of his race, so he brought all of the slaves together to formulate a plan. After many nights of late discussion, the Giants and Cokt were prepared to secure their future.\nOne night, after Kovir had gone to bed, Cokt got out of his cot and snuck to Kovir’s safe, where the nearly completed Firearm was kept. Cokt had carefully watched Kovir opened the safe in the prior days, so he was able to get it open. He had snuck through the estate many times before, so this was nothing new to him. Unfortunately, he did not count on a surprise visit. Unbeknownst to Cokt, the Dragon Cult were dropping by unannounced to pick up the weapon. They loudly knocked on the door as he was approaching it with the gun, and not one second later, the door was beaten down. The cultists rushed in as Kovir appeared at the top of the stairs. Before any confrontation could happen, the robed figures saw Cokt running off with the firearm and gave suit.\nCokt let out a cry, and crashing through the nearby windows were many Giants, who were holed up outside the mansion, waiting for a signal if necessary. They were only able to get in the way before bolts of arcane energy struck them from the cultists. Kovir jumped from the top of the staircase and joined the cultists in the fray as more Giants poured in through the window. Cokt jumped to the outside, finding a group of Giants storming the door behind the cultists. One of these Giants was Locht, who quickly threw Cokt up onto his back and sprinted to their quarters where Krilrym was waiting.\nAs Locht was running, the shackles around his wrists began to glow as chains sprouted from the ground and held him by his hands and feet. Cokt was thrown from Locht’s shoulders, firearm still in hand. “Locht, tsk tsk,” Kovir spat with sarcasm, “I never took you to be a traitor. It’s a shame I can’t have another one of your meals.” Faster than anyone expected, the Giant slammed a glowing crystal into the cook’s chest as he erupted into flames. Locht was nothing but a smoldering pile.\n“Little One, how about we step back into the workshop”. A line of Giant and cultist bodies strewn about behind him, leading back to the door. “We have so much more work to do.”\nCokt looked his master in the eyes, hoisted his weapon, and pointed it towards him. Latent memories came back to Cokt, words that he never knew he understood. “You have kept me here long enough,” Cokt spoke in Goblin, a language he did not remember hearing. “It’s time I send you to where you belong.” Cokt yanked on the trigger, trying to balance the gun that was just a bit too large for his short stature, and a blast of metal flew out of the barrel, slamming into Kovir and knocking him down. Cokt ran from his master with tears in his eyes and into the quarters.\nHe found Krilrym inside, standing over a large circle in the floor. Surrounding the circle were various symbols that Cokt had never seen before. The Giant had a rock in his hand, and he was carving something into it while humming a tune that could only be described as ancient. “I’m glad to see you’ve made it,” he said in Giant. “No time to waste, hand me the weapon.”\nCokt walked over to him and held it to him. The Giant took the stone, kissed it, muttered something in Dwarf, and crushed it in his hand. He threw the dust onto the firearm, sprinkling some onto Cokt’s head, too. “Where are we going?” Cokt asked in Giant.\n“I’m afraid I cannot join you,” Krilrym said with a sigh. “You must go on without me, but I’ve left a piece of me with you.” Cokt stared at him blankly but Krilrym dryly laughed. “You’ll understand soon enough.”\nHe led Cokt to the center of the circle and got down on one knee. He pat Cokt on the head and said, “It’s time for you to go now, but do not forget what you have seen here. Those robed figures,” he gestured towards the mansion, “must get what they deserve. It is of utmost importance that you investigate their dealings and do away with them.”\nCokt nodded and sniffled, clenching the firearm now covered in dust. “Will I see you again?” he asked.\n“Time will tell, time will tell.” Krilrym sighed and paused for a moment. “It’s time for my swan song,” he whispered in Dwarven. He stepped out of the circle and began to sing a melody that Cokt would go on to describe as hopeful. The symbols and runes on the floor began to glow, as a ring of purple light started to close in on the Goblin. He watched his close friend in awe as the entire world began to glow, while slowly fading to black. Cokt’s mind drifted away as he thought about The Future."},"The-Future":{"title":"The Future","links":[],"tags":[],"content":"Cokt awoke in a pile of hay, groggy and sad. As his senses came to, and after internalizing what had just happened, he laid back into the hay and began to sob. He was soon interrupted by two men walking by, describing tales they had heard about a cult in the next town over. Without wasting a second, Cokt wiped his nose, grabbed his new weapon, and head towards the town, determined to take on the cult and avenge his brothers."},"index":{"title":"Cokt","links":["Early-Life","Life-on-the-Estate","Revolt"],"tags":[],"content":"Cokt is a goblin with a gun. → That’s pretty much it.\nTable of Contents:\n\nEarly Life\nLife on the Estate\nRevolt\n"},"index2":{"title":"Welcome to Quartz","links":[],"tags":[],"content":"This is a blank Quartz installation.\nSee the documentation for how to get started."}}